xs2a-connector/src/test/resources/json/mappers/single-payment-to.json

{
  "paymentId": "myPaymentId",
  "endToEndIdentification": "123456789",
  "debtorAccount":
  {
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "pan": "1111",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "currency": "EUR"
  },
  "instructedAmount":
  {
    "currency": "EUR",
    "amount": 100
  },
  "creditorAccount":
  {
    "iban": "DE52500105173911841934",
    "bban": "Test BBAN",
    "pan": "1111",
    "maskedPan": "23456xxxxxx1234",
    "msisdn": "0172/1111111",
    "currency": "EUR"
  },
  "creditorAgent": "agent",
  "creditorName": "Rozetka.ua",
  "creditorAddress":
  {
    "street": "SomeStreet",
    "buildingNumber": "666",
    "city": "Kiev",
    "postalCode": "04210",
    "country": "Ukraine"
  },
  "remittanceInformationUnstructured": "remittance",
  "paymentStatus": "RCVD",
  "paymentProduct": "SEPA",
  "requestedExecutionDate": "2018-12-12",
  "requestedExecutionTime": "12:00:00"
}